        ---------    Running Demo for the DFT Layer    ---------


>>
>> This file will run a bespoke model to handle the following task:
>> -> `Speech Recognition`
>>
>> To accomplish this, I will define 2 models:
>> -> One with the DFT Layer high up in the architecture.
>> -> One using more typical Machine Learning Practices.
>>
>> After training has completed I will run each model through an extensive test
>> to determine whether or not the DFT layer bears any benefit to signal processing networks.
>> The typical Machine Learning model will be pulled from blogposts on the internet. Doing this
>> should ensure I'm comparing my work to the tried and tested models used in the world today.
>>
>> The data I'm using for this application comes from Kaggle:
>> https://www.kaggle.com/c/tensorflow-speech-recognition-challenge/data
>>
>> The Standard model I'm using comes from:
>> https://github.com/aravindpai/Speech-Recognition/blob/master/Speech%20Recognition.ipynb
>>


>>
>> First, we’ll visualize the audio signal in the time domain:
>>

Audio Sampling rate: 16000 Hz

>>
>> Now, let’s understand the number of recordings for each voice command:
>>


>>
>> What’s next? A look at the distribution of the duration of recordings:
>>


>>
>> In the data exploration part earlier, we have seen that the duration of a few recordings is less than 1
>> second and the sampling rate is too high. So, let us read the audio waves and use the below-preprocessing
>> steps to deal with this. Here are the two steps we’ll follow:
>>
>> -> Resampling
>> -> Removing commands shorter than 1 second
>>
>> Let us define these preprocessing steps in the below code snippet:
>>

yes
no
up
down
left
right
on
off
stop
go

>>
>> Convert the output labels to integer encoded:
>>

Training Data Shape: (21312, 8000)
Presentation Shape: (8000,)

>>
>> Next, we will train the model on 80% of the data and validate on the remaining 20%:
>>

Training generator defined and instantiated

2020-10-30 19:38:46.654082: I tensorflow/core/platform/cpu_feature_guard.cc:145] This TensorFlow binary is optimized with Intel(R) MKL-DNN to use the following CPU instructions in performance critical operations:  AVX AVX2
To enable them in non-MKL-DNN operations, rebuild TensorFlow with the appropriate compiler flags.
2020-10-30 19:38:46.685143: I tensorflow/core/common_runtime/process_util.cc:115] Creating new thread pool with default inter op setting: 12. Tune using inter_op_parallelism_threads for best performance.
First 10 DFT's done...
First 20 DFT's done...
First 30 DFT's done...
First 40 DFT's done...
First 50 DFT's done...
All DFT's done!
DFT Stack Complete

        --------- Model building took 21.312990427017212 seconds ---------

Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 8000)]       0
__________________________________________________________________________________________________
tf_op_layer_Pad (TensorFlowOpLa [(None, 8064)]       0           input_1[0][0]
__________________________________________________________________________________________________
tf_op_layer_split (TensorFlowOp [(None, 128), (None, 0           tf_op_layer_Pad[0][0]
__________________________________________________________________________________________________
dft (DFT)                       (None, 128)          32768       tf_op_layer_split[0][0]
__________________________________________________________________________________________________
dft_1 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][1]
__________________________________________________________________________________________________
dft_2 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][2]
__________________________________________________________________________________________________
dft_3 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][3]
__________________________________________________________________________________________________
dft_4 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][4]
__________________________________________________________________________________________________
dft_5 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][5]
__________________________________________________________________________________________________
dft_6 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][6]
__________________________________________________________________________________________________
dft_7 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][7]
__________________________________________________________________________________________________
dft_8 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][8]
__________________________________________________________________________________________________
dft_9 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][9]
__________________________________________________________________________________________________
dft_13 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][13]
__________________________________________________________________________________________________
dft_14 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][14]
__________________________________________________________________________________________________
dft_15 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][15]
__________________________________________________________________________________________________
dft_16 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][16]
__________________________________________________________________________________________________
dft_17 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][17]
__________________________________________________________________________________________________
dft_18 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][18]
__________________________________________________________________________________________________
dft_19 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][19]
__________________________________________________________________________________________________
dft_20 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][20]
__________________________________________________________________________________________________
dft_21 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][21]
__________________________________________________________________________________________________
dft_22 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][22]
__________________________________________________________________________________________________
dft_23 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][23]
__________________________________________________________________________________________________
dft_24 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][24]
__________________________________________________________________________________________________
dft_25 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][25]
__________________________________________________________________________________________________
dft_26 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][26]
__________________________________________________________________________________________________
dft_27 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][27]
__________________________________________________________________________________________________
dft_28 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][28]
__________________________________________________________________________________________________
dft_29 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][29]
__________________________________________________________________________________________________
dft_30 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][30]
__________________________________________________________________________________________________
dft_31 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][31]
__________________________________________________________________________________________________
dft_32 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][32]
__________________________________________________________________________________________________
dft_33 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][33]
__________________________________________________________________________________________________
dft_34 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][34]
__________________________________________________________________________________________________
dft_35 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][35]
__________________________________________________________________________________________________
dft_36 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][36]
__________________________________________________________________________________________________
dft_37 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][37]
__________________________________________________________________________________________________
dft_38 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][38]
__________________________________________________________________________________________________
dft_39 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][39]
__________________________________________________________________________________________________
dft_40 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][40]
__________________________________________________________________________________________________
dft_41 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][41]
__________________________________________________________________________________________________
dft_42 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][42]
__________________________________________________________________________________________________
dft_43 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][43]
__________________________________________________________________________________________________
dft_44 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][44]
__________________________________________________________________________________________________
dft_45 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][45]
__________________________________________________________________________________________________
dft_46 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][46]
__________________________________________________________________________________________________
dft_47 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][47]
__________________________________________________________________________________________________
dft_48 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][48]
__________________________________________________________________________________________________
dft_49 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][49]
__________________________________________________________________________________________________
dft_50 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][50]
__________________________________________________________________________________________________
dft_51 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][51]
__________________________________________________________________________________________________
dft_52 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][52]
__________________________________________________________________________________________________
dft_53 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][53]
__________________________________________________________________________________________________
dft_54 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][54]
__________________________________________________________________________________________________
dft_55 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][55]
__________________________________________________________________________________________________
dft_56 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][56]
__________________________________________________________________________________________________
dft_57 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][57]
__________________________________________________________________________________________________
dft_58 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][58]
__________________________________________________________________________________________________
dft_59 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][59]
__________________________________________________________________________________________________
dft_60 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][60]
__________________________________________________________________________________________________
dft_61 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][61]
__________________________________________________________________________________________________
dft_62 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][62]
__________________________________________________________________________________________________
tf_op_layer_stack (TensorFlowOp [(63, None, 128)]    0           dft[0][0]
                                                                 dft_1[0][0]
                                                                 dft_2[0][0]
                                                                 dft_3[0][0]
                                                                 dft_4[0][0]
                                                                 dft_5[0][0]
                                                                 dft_6[0][0]
                                                                 dft_7[0][0]
                                                                 dft_8[0][0]
                                                                 dft_9[0][0]
                                                                 dft_1[0][0]
                                                                 dft_1[0][0]
                                                                 dft_1[0][0]
                                                                 dft_13[0][0]
                                                                 dft_14[0][0]
                                                                 dft_15[0][0]
                                                                 dft_16[0][0]
                                                                 dft_17[0][0]
                                                                 dft_18[0][0]
                                                                 dft_19[0][0]
                                                                 dft_20[0][0]
                                                                 dft_21[0][0]
                                                                 dft_22[0][0]
                                                                 dft_23[0][0]
                                                                 dft_24[0][0]
                                                                 dft_25[0][0]
                                                                 dft_26[0][0]
                                                                 dft_27[0][0]
                                                                 dft_28[0][0]
                                                                 dft_29[0][0]
                                                                 dft_30[0][0]
                                                                 dft_31[0][0]
                                                                 dft_32[0][0]
                                                                 dft_33[0][0]
                                                                 dft_34[0][0]
                                                                 dft_35[0][0]
                                                                 dft_36[0][0]
                                                                 dft_37[0][0]
                                                                 dft_38[0][0]
                                                                 dft_39[0][0]
                                                                 dft_40[0][0]
                                                                 dft_41[0][0]
                                                                 dft_42[0][0]
                                                                 dft_43[0][0]
                                                                 dft_44[0][0]
                                                                 dft_45[0][0]
                                                                 dft_46[0][0]
                                                                 dft_47[0][0]
                                                                 dft_48[0][0]
                                                                 dft_49[0][0]
                                                                 dft_50[0][0]
                                                                 dft_51[0][0]
                                                                 dft_52[0][0]
                                                                 dft_53[0][0]
                                                                 dft_54[0][0]
                                                                 dft_55[0][0]
                                                                 dft_56[0][0]
                                                                 dft_57[0][0]
                                                                 dft_58[0][0]
                                                                 dft_59[0][0]
                                                                 dft_60[0][0]
                                                                 dft_61[0][0]
                                                                 dft_62[0][0]
__________________________________________________________________________________________________
tf_op_layer_Abs (TensorFlowOpLa [(63, None, 128)]    0           tf_op_layer_stack[0][0]
__________________________________________________________________________________________________
tf_op_layer_transpose (TensorFl [(None, 63, 128)]    0           tf_op_layer_Abs[0][0]
__________________________________________________________________________________________________
dropout (Dropout)               (None, 63, 128)      0           tf_op_layer_transpose[0][0]
__________________________________________________________________________________________________
separable_conv1d (SeparableConv (None, 60, 256)      33536       dropout[0][0]
__________________________________________________________________________________________________
separable_conv1d_3 (SeparableCo (None, 60, 256)      33536       tf_op_layer_transpose[0][0]
__________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)    (None, 15, 256)      0           separable_conv1d[0][0]
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 15, 256)      0           separable_conv1d_3[0][0]
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 15, 256)      0           max_pooling1d[0][0]
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 15, 256)      0           max_pooling1d_3[0][0]
__________________________________________________________________________________________________
separable_conv1d_1 (SeparableCo (None, 12, 256)      66816       dropout_1[0][0]
__________________________________________________________________________________________________
separable_conv1d_4 (SeparableCo (None, 12, 256)      66816       dropout_5[0][0]
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 6, 256)       0           separable_conv1d_1[0][0]
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 6, 256)       0           separable_conv1d_4[0][0]
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 6, 256)       0           max_pooling1d_1[0][0]
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 6, 256)       0           max_pooling1d_4[0][0]
__________________________________________________________________________________________________
separable_conv1d_2 (SeparableCo (None, 3, 256)       66816       dropout_2[0][0]
__________________________________________________________________________________________________
separable_conv1d_5 (SeparableCo (None, 3, 256)       66816       dropout_6[0][0]
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 1, 256)       0           separable_conv1d_2[0][0]
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, 1, 256)       0           separable_conv1d_5[0][0]
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 1, 256)       0           max_pooling1d_2[0][0]
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 1, 256)       0           max_pooling1d_5[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 256)          0           dropout_3[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 256)          0           dropout_7[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 32)           8224        flatten[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 32)           8224        flatten_1[0][0]
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 32)           0           dense[0][0]
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 32)           0           dense_1[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 64)           0           dropout_4[0][0]
                                                                 dropout_8[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 32)           2080        concatenate[0][0]
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 32)           0           dense_2[0][0]
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 32)           1056        dropout_9[0][0]
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 32)           0           dense_3[0][0]
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 10)           330         dropout_10[0][0]
==================================================================================================
Total params: 2,320,330
Trainable params: 2,320,330
Non-trainable params: 0
__________________________________________________________________________________________________
Train on 17049 samples, validate on 4263 samples
Epoch 1/100
17049/17049 [==============================] - 45s 3ms/sample - loss: 2.2490 - accuracy: 0.1308 - val_loss: 2.0306 - val_accuracy: 0.1813
Epoch 2/100
17049/17049 [==============================] - 36s 2ms/sample - loss: 1.9551 - accuracy: 0.2128 - val_loss: 1.7945 - val_accuracy: 0.2824
Epoch 3/100
17049/17049 [==============================] - 36s 2ms/sample - loss: 1.7559 - accuracy: 0.2905 - val_loss: 1.5748 - val_accuracy: 0.3835
Epoch 4/100
17049/17049 [==============================] - 35s 2ms/sample - loss: 1.5189 - accuracy: 0.3971 - val_loss: 1.3780 - val_accuracy: 0.4609
Epoch 5/100
17049/17049 [==============================] - 36s 2ms/sample - loss: 1.2987 - accuracy: 0.4821 - val_loss: 1.1529 - val_accuracy: 0.5801
Epoch 6/100
17049/17049 [==============================] - 35s 2ms/sample - loss: 1.1507 - accuracy: 0.5421 - val_loss: 1.0726 - val_accuracy: 0.6118
Epoch 7/100
17049/17049 [==============================] - 35s 2ms/sample - loss: 1.0439 - accuracy: 0.5955 - val_loss: 1.0755 - val_accuracy: 0.6467
Epoch 8/100
17049/17049 [==============================] - 36s 2ms/sample - loss: 0.9566 - accuracy: 0.6341 - val_loss: 1.0350 - val_accuracy: 0.6585
Epoch 9/100
17049/17049 [==============================] - 36s 2ms/sample - loss: 0.8758 - accuracy: 0.6656 - val_loss: 1.0000 - val_accuracy: 0.6880
Epoch 10/100
17049/17049 [==============================] - 35s 2ms/sample - loss: 0.8227 - accuracy: 0.6968 - val_loss: 0.9981 - val_accuracy: 0.6972
Epoch 11/100
17049/17049 [==============================] - 35s 2ms/sample - loss: 0.7620 - accuracy: 0.7255 - val_loss: 0.9572 - val_accuracy: 0.7314
Epoch 12/100
17049/17049 [==============================] - 36s 2ms/sample - loss: 0.7037 - accuracy: 0.7568 - val_loss: 0.9598 - val_accuracy: 0.7284
Epoch 13/100
17049/17049 [==============================] - 34s 2ms/sample - loss: 0.6591 - accuracy: 0.7752 - val_loss: 1.0277 - val_accuracy: 0.7450
Epoch 14/100
17049/17049 [==============================] - 34s 2ms/sample - loss: 0.6200 - accuracy: 0.7939 - val_loss: 0.9723 - val_accuracy: 0.7499
Epoch 15/100
17049/17049 [==============================] - 34s 2ms/sample - loss: 0.5940 - accuracy: 0.8071 - val_loss: 0.9799 - val_accuracy: 0.7530
Epoch 16/100
17049/17049 [==============================] - 34s 2ms/sample - loss: 0.5542 - accuracy: 0.8239 - val_loss: 0.9872 - val_accuracy: 0.7635
Epoch 00016: early stopping
Model Saved!