        ---------    Running Demo for the DFT Layer    ---------


>>
>> This file will run a bespoke model to handle the following task:
>> -> `Speech Recognition`
>>
>> To accomplish this, I will define 2 models:
>> -> One with the DFT Layer high up in the architecture.
>> -> One using more typical Machine Learning Practices.
>>
>> After training has completed I will run each model through an extensive test
>> to determine whether or not the DFT layer bears any benefit to signal processing networks.
>> The typical Machine Learning model will be pulled from blogposts on the internet. Doing this
>> should ensure I'm comparing my work to the tried and tested models used in the world today.
>>
>> The data I'm using for this application comes from Kaggle:
>> https://www.kaggle.com/c/tensorflow-speech-recognition-challenge/data
>>
>> The Standard model I'm using comes from:
>> https://github.com/aravindpai/Speech-Recognition/blob/master/Speech%20Recognition.ipynb
>>


>>
>> First, we’ll visualize the audio signal in the time domain:
>>

Audio Sampling rate: 16000 Hz

>>
>> Now, let’s understand the number of recordings for each voice command:
>>


>>
>> What’s next? A look at the distribution of the duration of recordings:
>>


>>
>> In the data exploration part earlier, we have seen that the duration of a few recordings is less than 1
>> second and the sampling rate is too high. So, let us read the audio waves and use the below-preprocessing
>> steps to deal with this. Here are the two steps we’ll follow:
>>
>> -> Resampling
>> -> Removing commands shorter than 1 second
>>
>> Let us define these preprocessing steps in the below code snippet:
>>

yes
no
up
down
left
right
on
off
stop
go

>>
>> Convert the output labels to integer encoded:
>>

Training Data Shape: (21312, 8000)
Presentation Shape: (8000,)

>>
>> Next, we will train the model on 80% of the data and validate on the remaining 20%:
>>

Training generator defined and instantiated

2020-10-28 23:24:21.272325: I tensorflow/core/platform/cpu_feature_guard.cc:145] This TensorFlow binary is optimized with Intel(R) MKL-DNN to use the following CPU instructions in performance critical operations:  AVX AVX2
To enable them in non-MKL-DNN operations, rebuild TensorFlow with the appropriate compiler flags.
2020-10-28 23:24:21.312368: I tensorflow/core/common_runtime/process_util.cc:115] Creating new thread pool with default inter op setting: 12. Tune using inter_op_parallelism_threads for best performance.
First 10 DFT's done...
First 20 DFT's done...
First 30 DFT's done...
First 40 DFT's done...
First 50 DFT's done...
All DFT's done!
DFT Stack Complete

        --------- Model building took 24.965627908706665 seconds ---------

Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 8000)]       0
__________________________________________________________________________________________________
tf_op_layer_Pad (TensorFlowOpLa [(None, 8064)]       0           input_1[0][0]
__________________________________________________________________________________________________
tf_op_layer_split (TensorFlowOp [(None, 128), (None, 0           tf_op_layer_Pad[0][0]
__________________________________________________________________________________________________
dft (DFT)                       (None, 128)          32768       tf_op_layer_split[0][0]
__________________________________________________________________________________________________
dft_1 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][1]
__________________________________________________________________________________________________
dft_2 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][2]
__________________________________________________________________________________________________
dft_3 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][3]
__________________________________________________________________________________________________
dft_4 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][4]
__________________________________________________________________________________________________
dft_5 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][5]
__________________________________________________________________________________________________
dft_6 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][6]
__________________________________________________________________________________________________
dft_7 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][7]
__________________________________________________________________________________________________
dft_8 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][8]
__________________________________________________________________________________________________
dft_9 (DFT)                     (None, 128)          32768       tf_op_layer_split[0][9]
__________________________________________________________________________________________________
dft_13 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][13]
__________________________________________________________________________________________________
dft_14 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][14]
__________________________________________________________________________________________________
dft_15 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][15]
__________________________________________________________________________________________________
dft_16 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][16]
__________________________________________________________________________________________________
dft_17 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][17]
__________________________________________________________________________________________________
dft_18 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][18]
__________________________________________________________________________________________________
dft_19 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][19]
__________________________________________________________________________________________________
dft_20 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][20]
__________________________________________________________________________________________________
dft_21 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][21]
__________________________________________________________________________________________________
dft_22 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][22]
__________________________________________________________________________________________________
dft_23 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][23]
__________________________________________________________________________________________________
dft_24 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][24]
__________________________________________________________________________________________________
dft_25 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][25]
__________________________________________________________________________________________________
dft_26 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][26]
__________________________________________________________________________________________________
dft_27 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][27]
__________________________________________________________________________________________________
dft_28 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][28]
__________________________________________________________________________________________________
dft_29 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][29]
__________________________________________________________________________________________________
dft_30 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][30]
__________________________________________________________________________________________________
dft_31 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][31]
__________________________________________________________________________________________________
dft_32 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][32]
__________________________________________________________________________________________________
dft_33 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][33]
__________________________________________________________________________________________________
dft_34 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][34]
__________________________________________________________________________________________________
dft_35 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][35]
__________________________________________________________________________________________________
dft_36 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][36]
__________________________________________________________________________________________________
dft_37 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][37]
__________________________________________________________________________________________________
dft_38 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][38]
__________________________________________________________________________________________________
dft_39 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][39]
__________________________________________________________________________________________________
dft_40 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][40]
__________________________________________________________________________________________________
dft_41 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][41]
__________________________________________________________________________________________________
dft_42 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][42]
__________________________________________________________________________________________________
dft_43 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][43]
__________________________________________________________________________________________________
dft_44 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][44]
__________________________________________________________________________________________________
dft_45 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][45]
__________________________________________________________________________________________________
dft_46 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][46]
__________________________________________________________________________________________________
dft_47 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][47]
__________________________________________________________________________________________________
dft_48 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][48]
__________________________________________________________________________________________________
dft_49 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][49]
__________________________________________________________________________________________________
dft_50 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][50]
__________________________________________________________________________________________________
dft_51 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][51]
__________________________________________________________________________________________________
dft_52 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][52]
__________________________________________________________________________________________________
dft_53 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][53]
__________________________________________________________________________________________________
dft_54 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][54]
__________________________________________________________________________________________________
dft_55 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][55]
__________________________________________________________________________________________________
dft_56 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][56]
__________________________________________________________________________________________________
dft_57 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][57]
__________________________________________________________________________________________________
dft_58 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][58]
__________________________________________________________________________________________________
dft_59 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][59]
__________________________________________________________________________________________________
dft_60 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][60]
__________________________________________________________________________________________________
dft_61 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][61]
__________________________________________________________________________________________________
dft_62 (DFT)                    (None, 128)          32768       tf_op_layer_split[0][62]
__________________________________________________________________________________________________
tf_op_layer_stack (TensorFlowOp [(63, None, 128)]    0           dft[0][0]
                                                                 dft_1[0][0]
                                                                 dft_2[0][0]
                                                                 dft_3[0][0]
                                                                 dft_4[0][0]
                                                                 dft_5[0][0]
                                                                 dft_6[0][0]
                                                                 dft_7[0][0]
                                                                 dft_8[0][0]
                                                                 dft_9[0][0]
                                                                 dft_1[0][0]
                                                                 dft_1[0][0]
                                                                 dft_1[0][0]
                                                                 dft_13[0][0]
                                                                 dft_14[0][0]
                                                                 dft_15[0][0]
                                                                 dft_16[0][0]
                                                                 dft_17[0][0]
                                                                 dft_18[0][0]
                                                                 dft_19[0][0]
                                                                 dft_20[0][0]
                                                                 dft_21[0][0]
                                                                 dft_22[0][0]
                                                                 dft_23[0][0]
                                                                 dft_24[0][0]
                                                                 dft_25[0][0]
                                                                 dft_26[0][0]
                                                                 dft_27[0][0]
                                                                 dft_28[0][0]
                                                                 dft_29[0][0]
                                                                 dft_30[0][0]
                                                                 dft_31[0][0]
                                                                 dft_32[0][0]
                                                                 dft_33[0][0]
                                                                 dft_34[0][0]
                                                                 dft_35[0][0]
                                                                 dft_36[0][0]
                                                                 dft_37[0][0]
                                                                 dft_38[0][0]
                                                                 dft_39[0][0]
                                                                 dft_40[0][0]
                                                                 dft_41[0][0]
                                                                 dft_42[0][0]
                                                                 dft_43[0][0]
                                                                 dft_44[0][0]
                                                                 dft_45[0][0]
                                                                 dft_46[0][0]
                                                                 dft_47[0][0]
                                                                 dft_48[0][0]
                                                                 dft_49[0][0]
                                                                 dft_50[0][0]
                                                                 dft_51[0][0]
                                                                 dft_52[0][0]
                                                                 dft_53[0][0]
                                                                 dft_54[0][0]
                                                                 dft_55[0][0]
                                                                 dft_56[0][0]
                                                                 dft_57[0][0]
                                                                 dft_58[0][0]
                                                                 dft_59[0][0]
                                                                 dft_60[0][0]
                                                                 dft_61[0][0]
                                                                 dft_62[0][0]
__________________________________________________________________________________________________
tf_op_layer_Abs (TensorFlowOpLa [(63, None, 128)]    0           tf_op_layer_stack[0][0]
__________________________________________________________________________________________________
tf_op_layer_transpose (TensorFl [(None, 63, 128)]    0           tf_op_layer_Abs[0][0]
__________________________________________________________________________________________________
dropout (Dropout)               (None, 63, 128)      0           tf_op_layer_transpose[0][0]
__________________________________________________________________________________________________
separable_conv1d (SeparableConv (None, 60, 512)      66560       dropout[0][0]
__________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)    (None, 15, 512)      0           separable_conv1d[0][0]
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 15, 512)      0           max_pooling1d[0][0]
__________________________________________________________________________________________________
separable_conv1d_1 (SeparableCo (None, 12, 512)      264704      dropout_1[0][0]
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 6, 512)       0           separable_conv1d_1[0][0]
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 6, 512)       0           max_pooling1d_1[0][0]
__________________________________________________________________________________________________
separable_conv1d_2 (SeparableCo (None, 3, 256)       133376      dropout_2[0][0]
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 1, 256)       0           separable_conv1d_2[0][0]
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 1, 256)       0           max_pooling1d_2[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 256)          0           dropout_3[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 128)          32896       flatten[0][0]
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 128)          0           dense[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           8256        dropout_4[0][0]
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 64)           0           dense_1[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10)           650         dropout_5[0][0]
==================================================================================================
Total params: 2,472,522
Trainable params: 2,472,522
Non-trainable params: 0
__________________________________________________________________________________________________
Train on 17049 samples, validate on 4263 samples
Epoch 1/100
17049/17049 [==============================] - 67s 4ms/sample - loss: 2.0926 - accuracy: 0.1968 - val_loss: 1.6325 - val_accuracy: 0.3767
Epoch 2/100
17049/17049 [==============================] - 55s 3ms/sample - loss: 1.4475 - accuracy: 0.4618 - val_loss: 1.0522 - val_accuracy: 0.6327
Epoch 3/100
17049/17049 [==============================] - 54s 3ms/sample - loss: 1.1268 - accuracy: 0.6012 - val_loss: 0.8823 - val_accuracy: 0.7042
Epoch 4/100
17049/17049 [==============================] - 54s 3ms/sample - loss: 0.9573 - accuracy: 0.6686 - val_loss: 0.7640 - val_accuracy: 0.7413
Epoch 5/100
17049/17049 [==============================] - 54s 3ms/sample - loss: 0.8399 - accuracy: 0.7127 - val_loss: 0.7478 - val_accuracy: 0.7565
Epoch 6/100
17049/17049 [==============================] - 54s 3ms/sample - loss: 0.7727 - accuracy: 0.7419 - val_loss: 0.6657 - val_accuracy: 0.7837
Epoch 7/100
17049/17049 [==============================] - 54s 3ms/sample - loss: 0.7259 - accuracy: 0.7578 - val_loss: 0.6480 - val_accuracy: 0.7804
Epoch 8/100
17049/17049 [==============================] - 54s 3ms/sample - loss: 0.6717 - accuracy: 0.7742 - val_loss: 0.7035 - val_accuracy: 0.7675
Epoch 9/100
17049/17049 [==============================] - 55s 3ms/sample - loss: 0.6475 - accuracy: 0.7857 - val_loss: 0.6055 - val_accuracy: 0.8013
Epoch 10/100
17049/17049 [==============================] - 55s 3ms/sample - loss: 0.5948 - accuracy: 0.7997 - val_loss: 0.6158 - val_accuracy: 0.7990
Epoch 11/100
17049/17049 [==============================] - 54s 3ms/sample - loss: 0.5806 - accuracy: 0.8063 - val_loss: 0.5950 - val_accuracy: 0.8058
Epoch 12/100
17049/17049 [==============================] - 54s 3ms/sample - loss: 0.5569 - accuracy: 0.8154 - val_loss: 0.6091 - val_accuracy: 0.8025
Epoch 13/100
17049/17049 [==============================] - 55s 3ms/sample - loss: 0.5375 - accuracy: 0.8192 - val_loss: 0.5972 - val_accuracy: 0.8025
Epoch 14/100
17049/17049 [==============================] - 51s 3ms/sample - loss: 0.5224 - accuracy: 0.8301 - val_loss: 0.6127 - val_accuracy: 0.8051
Epoch 15/100
17049/17049 [==============================] - 47s 3ms/sample - loss: 0.4980 - accuracy: 0.8352 - val_loss: 0.5911 - val_accuracy: 0.8187
Epoch 16/100
17049/17049 [==============================] - 47s 3ms/sample - loss: 0.4828 - accuracy: 0.8368 - val_loss: 0.5890 - val_accuracy: 0.8177
Epoch 17/100
17049/17049 [==============================] - 46s 3ms/sample - loss: 0.4748 - accuracy: 0.8432 - val_loss: 0.5906 - val_accuracy: 0.8152
Epoch 18/100
17049/17049 [==============================] - 48s 3ms/sample - loss: 0.4567 - accuracy: 0.8508 - val_loss: 0.5738 - val_accuracy: 0.8198
Epoch 19/100
17049/17049 [==============================] - 48s 3ms/sample - loss: 0.4383 - accuracy: 0.8535 - val_loss: 0.6816 - val_accuracy: 0.8154
Epoch 20/100
17049/17049 [==============================] - 48s 3ms/sample - loss: 0.4392 - accuracy: 0.8534 - val_loss: 0.5998 - val_accuracy: 0.8126
Epoch 21/100
17049/17049 [==============================] - 48s 3ms/sample - loss: 0.4284 - accuracy: 0.8579 - val_loss: 0.5831 - val_accuracy: 0.8243
Epoch 22/100
17049/17049 [==============================] - 49s 3ms/sample - loss: 0.4032 - accuracy: 0.8691 - val_loss: 0.5703 - val_accuracy: 0.8349
Epoch 23/100
17049/17049 [==============================] - 48s 3ms/sample - loss: 0.4063 - accuracy: 0.8657 - val_loss: 0.6160 - val_accuracy: 0.8266
Epoch 24/100
17049/17049 [==============================] - 48s 3ms/sample - loss: 0.3941 - accuracy: 0.8696 - val_loss: 0.6107 - val_accuracy: 0.8238
Epoch 25/100
17049/17049 [==============================] - 48s 3ms/sample - loss: 0.4013 - accuracy: 0.8680 - val_loss: 0.5998 - val_accuracy: 0.8187
Epoch 26/100
17049/17049 [==============================] - 45s 3ms/sample - loss: 0.3835 - accuracy: 0.8767 - val_loss: 0.5891 - val_accuracy: 0.8229
Epoch 27/100
17049/17049 [==============================] - 50s 3ms/sample - loss: 0.3830 - accuracy: 0.8738 - val_loss: 0.6056 - val_accuracy: 0.8234
Epoch 00027: early stopping
Model Saved!